Ran Plan for 3 projects:

1. project: `apps-prod` dir: `4.apps` workspace: `prod`
1. project: `apps-staging` dir: `4.apps` workspace: `staging`
1. project: `platform` dir: `2.platform` workspace: `default`

### 1. project: `apps-prod` dir: `4.apps` workspace: `prod`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:bf6fb9e


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # kubernetes_namespace.kubero has been deleted
- resource "kubernetes_namespace" "kubero" {
        id                               = "kubero"
        # (1 unchanged attribute hidden)

      - metadata {
          - name             = "kubero" -> null
            # (4 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # kubectl_manifest.kubero_instance will be created
+ resource "kubectl_manifest" "kubero_instance" {
      + api_version             = "application.kubero.dev/v1alpha1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Kubero"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero"
      + namespace               = "kubero-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: application.kubero.dev/v1alpha1
            kind: Kubero
            metadata:
              name: kubero
              namespace: kubero-staging
            spec:
              image:
                pullPolicy: IfNotPresent
                repository: ghcr.io/kubero-dev/kubero/kubero
                tag: latest
              ingress:
                annotations:
                  cert-manager.io/cluster-issuer: letsencrypt-prod
                  traefik.ingress.kubernetes.io/router.middlewares: platform-portal-auth@kubernetescrd
                className: traefik
                enabled: true
                hosts:
                - host: kcloud.zitian.party
                  paths:
                  - path: /
                    pathType: Prefix
                tls:
                - hosts:
                  - kcloud.zitian.party
                  secretName: kubero-ui-tls
              kubero:
                auth:
                  github:
                    enabled: false
                config:
                  clusterissuer: letsencrypt-prod
                  kubero:
                    admin:
                      disabled: false
                    readonly: false
                context: inClusterContext
                namespace: kubero-staging
                sessionKey: 35d5a06a8c6a4cf6ff8dd4b6e7f1eb5b432c4cd5abaa14d1a46272796de476d8
              livenessProbe:
                httpGet:
                  path: /
                  port: 2000
                initialDelaySeconds: 30
                periodSeconds: 10
              persistence:
                accessModes:
                - ReadWriteOnce
                enabled: true
                size: 1Gi
                storageClass: local-path
              readinessProbe:
                httpGet:
                  path: /
                  port: 2000
                initialDelaySeconds: 5
                periodSeconds: 5
              replicaCount: 1
              service:
                port: 2000
                type: ClusterIP
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[21] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ServiceAccount"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: ServiceAccount
            metadata:
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system-staging
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[22] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Role"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-leader-election-role"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              name: kubero-operator-leader-election-role
              namespace: kubero-operator-system-staging
            rules:
            - apiGroups:
              - ""
              resources:
              - configmaps
              verbs:
              - get
              - list
              - watch
              - create
              - update
              - patch
              - delete
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - get
              - list
              - watch
              - create
              - update
              - patch
              - delete
            - apiGroups:
              - ""
              resources:
              - events
              verbs:
              - create
              - patch
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[44] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "RoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-leader-election-rolebinding"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              name: kubero-operator-leader-election-rolebinding
              namespace: kubero-operator-system-staging
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: kubero-operator-leader-election-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system-staging
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[45] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding"
        name                    = "kubero-operator-manager-rolebinding"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: kubero-operator-manager-rolebinding
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: kubero-operator-manager-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
          -   namespace: kubero-operator-system
          +   namespace: kubero-operator-system-staging
        EOT
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[46] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding"
        name                    = "kubero-operator-proxy-rolebinding"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: kubero-operator-proxy-rolebinding
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: kubero-operator-proxy-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
          -   namespace: kubero-operator-system
          +   namespace: kubero-operator-system-staging
        EOT
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[47] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-manager-config"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              controller_manager_config.yaml: |
                apiVersion: controller-runtime.sigs.k8s.io/v1alpha1
                kind: ControllerManagerConfig
                health:
                  healthProbeBindAddress: :8081
                metrics:
                  bindAddress: 127.0.0.1:8080
            
                leaderElection:
                  leaderElect: true
                  resourceName: 811c9dc5.kubero.dev
            kind: ConfigMap
            metadata:
              name: kubero-operator-manager-config
              namespace: kubero-operator-system-staging
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[48] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager-metrics-service"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                control-plane: controller-manager
              name: kubero-operator-controller-manager-metrics-service
              namespace: kubero-operator-system-staging
            spec:
              ports:
              - name: https
                port: 8443
                protocol: TCP
                targetPort: https
              selector:
                control-plane: controller-manager
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[49] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                control-plane: controller-manager
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system-staging
            spec:
              replicas: 1
              selector:
                matchLabels:
                  control-plane: controller-manager
              template:
                metadata:
                  annotations:
                    kubectl.kubernetes.io/default-container: manager
                  labels:
                    control-plane: controller-manager
                spec:
                  containers:
                  - args:
                    - --secure-listen-address=0.0.0.0:8443
                    - --upstream=http://127.0.0.1:8080/
                    - --logtostderr=true
                    - --v=0
                    image: gcr.io/kubebuilder/kube-rbac-proxy:v0.11.0
                    name: kube-rbac-proxy
                    ports:
                    - containerPort: 8443
                      name: https
                      protocol: TCP
                    resources:
                      limits:
                        cpu: 500m
                        memory: 128Mi
                      requests:
                        cpu: 5m
                        memory: 64Mi
                  - args:
                    - --health-probe-bind-address=:8081
                    - --metrics-bind-address=127.0.0.1:8080
                    - --leader-elect
                    - --leader-election-id=kubero-operator
                    - --zap-log-level=info
                    image: ghcr.io/kubero-dev/kubero-operator/kuberoapp:v0.2.2
                    livenessProbe:
                      httpGet:
                        path: /healthz
                        port: 8081
                      initialDelaySeconds: 15
                      periodSeconds: 20
                    name: manager
                    readinessProbe:
                      httpGet:
                        path: /readyz
                        port: 8081
                      initialDelaySeconds: 5
                      periodSeconds: 10
                    resources:
                      limits:
                        cpu: 1000m
                        memory: 1Gi
                      requests:
                        cpu: 100m
                        memory: 64Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                  securityContext:
                    runAsNonRoot: true
                  serviceAccountName: kubero-operator-controller-manager
                  terminationGracePeriodSeconds: 10
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_namespace.kubero will be created
+ resource "kubernetes_namespace" "kubero" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "layer" = "L4"
            }
          + name             = "kubero-staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.kubero_operator_system will be created
+ resource "kubernetes_namespace" "kubero_operator_system" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "control-plane" = "controller-manager"
              + "layer"         = "L4"
            }
          + name             = "kubero-operator-system-staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 9 to add, 2 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p apps-prod`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F4.apps%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p apps-prod`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 9 to add, 2 to change, 0 to destroy.

---
### 2. project: `apps-staging` dir: `4.apps` workspace: `staging`
<details><summary>Show Output</summary>

```diff
infra-flash-commit:bf6fb9e


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # kubectl_manifest.kubero_instance will be created
+ resource "kubectl_manifest" "kubero_instance" {
      + api_version             = "application.kubero.dev/v1alpha1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Kubero"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero"
      + namespace               = "kubero-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: application.kubero.dev/v1alpha1
            kind: Kubero
            metadata:
              name: kubero
              namespace: kubero-staging
            spec:
              image:
                pullPolicy: IfNotPresent
                repository: ghcr.io/kubero-dev/kubero/kubero
                tag: latest
              ingress:
                annotations:
                  cert-manager.io/cluster-issuer: letsencrypt-prod
                  traefik.ingress.kubernetes.io/router.middlewares: platform-portal-auth@kubernetescrd
                className: traefik
                enabled: true
                hosts:
                - host: kcloud.zitian.party
                  paths:
                  - path: /
                    pathType: Prefix
                tls:
                - hosts:
                  - kcloud.zitian.party
                  secretName: kubero-ui-tls
              kubero:
                auth:
                  github:
                    enabled: false
                config:
                  clusterissuer: letsencrypt-prod
                  kubero:
                    admin:
                      disabled: false
                    readonly: false
                context: inClusterContext
                namespace: kubero-staging
                sessionKey: 7b9f39df5cf61ddacb359f62fb51a624629e7daf629b61b3511d6ef0b4434efc
              livenessProbe:
                httpGet:
                  path: /
                  port: 2000
                initialDelaySeconds: 30
                periodSeconds: 10
              persistence:
                accessModes:
                - ReadWriteOnce
                enabled: true
                size: 1Gi
                storageClass: local-path
              readinessProbe:
                httpGet:
                  path: /
                  port: 2000
                initialDelaySeconds: 5
                periodSeconds: 5
              replicaCount: 1
              service:
                port: 2000
                type: ClusterIP
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[21] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ServiceAccount"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: ServiceAccount
            metadata:
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system-staging
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[22] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Role"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-leader-election-role"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: Role
            metadata:
              name: kubero-operator-leader-election-role
              namespace: kubero-operator-system-staging
            rules:
            - apiGroups:
              - ""
              resources:
              - configmaps
              verbs:
              - get
              - list
              - watch
              - create
              - update
              - patch
              - delete
            - apiGroups:
              - coordination.k8s.io
              resources:
              - leases
              verbs:
              - get
              - list
              - watch
              - create
              - update
              - patch
              - delete
            - apiGroups:
              - ""
              resources:
              - events
              verbs:
              - create
              - patch
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[44] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "rbac.authorization.k8s.io/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "RoleBinding"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-leader-election-rolebinding"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: RoleBinding
            metadata:
              name: kubero-operator-leader-election-rolebinding
              namespace: kubero-operator-system-staging
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: Role
              name: kubero-operator-leader-election-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system-staging
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[45] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding"
        name                    = "kubero-operator-manager-rolebinding"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: kubero-operator-manager-rolebinding
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: kubero-operator-manager-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
          -   namespace: kubero-operator-system
          +   namespace: kubero-operator-system-staging
        EOT
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[46] will be updated in-place
~ resource "kubectl_manifest" "kubero_operator" {
        id                      = "/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding"
        name                    = "kubero-operator-proxy-rolebinding"
      ~ yaml_body               = (sensitive value)
      ~ yaml_body_parsed        = <<-EOT
            apiVersion: rbac.authorization.k8s.io/v1
            kind: ClusterRoleBinding
            metadata:
              name: kubero-operator-proxy-rolebinding
            roleRef:
              apiGroup: rbac.authorization.k8s.io
              kind: ClusterRole
              name: kubero-operator-proxy-role
            subjects:
            - kind: ServiceAccount
              name: kubero-operator-controller-manager
          -   namespace: kubero-operator-system
          +   namespace: kubero-operator-system-staging
        EOT
        # (13 unchanged attributes hidden)
    }

  # kubectl_manifest.kubero_operator[47] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ConfigMap"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-manager-config"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data:
              controller_manager_config.yaml: |
                apiVersion: controller-runtime.sigs.k8s.io/v1alpha1
                kind: ControllerManagerConfig
                health:
                  healthProbeBindAddress: :8081
                metrics:
                  bindAddress: 127.0.0.1:8080
            
                leaderElection:
                  leaderElect: true
                  resourceName: 811c9dc5.kubero.dev
            kind: ConfigMap
            metadata:
              name: kubero-operator-manager-config
              namespace: kubero-operator-system-staging
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[48] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Service"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager-metrics-service"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            kind: Service
            metadata:
              labels:
                control-plane: controller-manager
              name: kubero-operator-controller-manager-metrics-service
              namespace: kubero-operator-system-staging
            spec:
              ports:
              - name: https
                port: 8443
                protocol: TCP
                targetPort: https
              selector:
                control-plane: controller-manager
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.kubero_operator[49] will be created
+ resource "kubectl_manifest" "kubero_operator" {
      + api_version             = "apps/v1"
      + apply_only              = false
      + field_manager           = "kubectl"
      + force_conflicts         = true
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Deployment"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "kubero-operator-controller-manager"
      + namespace               = "kubero-operator-system-staging"
      + server_side_apply       = true
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = false
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              labels:
                control-plane: controller-manager
              name: kubero-operator-controller-manager
              namespace: kubero-operator-system-staging
            spec:
              replicas: 1
              selector:
                matchLabels:
                  control-plane: controller-manager
              template:
                metadata:
                  annotations:
                    kubectl.kubernetes.io/default-container: manager
                  labels:
                    control-plane: controller-manager
                spec:
                  containers:
                  - args:
                    - --secure-listen-address=0.0.0.0:8443
                    - --upstream=http://127.0.0.1:8080/
                    - --logtostderr=true
                    - --v=0
                    image: gcr.io/kubebuilder/kube-rbac-proxy:v0.11.0
                    name: kube-rbac-proxy
                    ports:
                    - containerPort: 8443
                      name: https
                      protocol: TCP
                    resources:
                      limits:
                        cpu: 500m
                        memory: 128Mi
                      requests:
                        cpu: 5m
                        memory: 64Mi
                  - args:
                    - --health-probe-bind-address=:8081
                    - --metrics-bind-address=127.0.0.1:8080
                    - --leader-elect
                    - --leader-election-id=kubero-operator
                    - --zap-log-level=info
                    image: ghcr.io/kubero-dev/kubero-operator/kuberoapp:v0.2.2
                    livenessProbe:
                      httpGet:
                        path: /healthz
                        port: 8081
                      initialDelaySeconds: 15
                      periodSeconds: 20
                    name: manager
                    readinessProbe:
                      httpGet:
                        path: /readyz
                        port: 8081
                      initialDelaySeconds: 5
                      periodSeconds: 10
                    resources:
                      limits:
                        cpu: 1000m
                        memory: 1Gi
                      requests:
                        cpu: 100m
                        memory: 64Mi
                    securityContext:
                      allowPrivilegeEscalation: false
                  securityContext:
                    runAsNonRoot: true
                  serviceAccountName: kubero-operator-controller-manager
                  terminationGracePeriodSeconds: 10
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubernetes_namespace.kubero will be created
+ resource "kubernetes_namespace" "kubero" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "layer" = "L4"
            }
          + name             = "kubero-staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.kubero_operator_system will be created
+ resource "kubernetes_namespace" "kubero_operator_system" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "control-plane" = "controller-manager"
              + "layer"         = "L4"
            }
          + name             = "kubero-operator-system-staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 9 to add, 2 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p apps-staging`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F4.apps%252Fstaging)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p apps-staging`
</details>
Plan: 9 to add, 2 to change, 0 to destroy.

---
### 3. project: `platform` dir: `2.platform` workspace: `default`
```diff
infra-flash-commit:bf6fb9e


No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p platform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.zitian.party/lock?id=wangzitian0%252Finfra%252F2.platform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p platform`

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`